OdRxFacetProvider.getFacets(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdRxMemberQueryContext!System.Runtime.CompilerServices.IsConst*,OdArray&lt;OdSmartPtr&lt;OdRxClass&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxClass&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
This method is called every time when OdRxMemberQueryEngine::find or
OdRxMemberQueryEngine::newMemberIterator is called.
Facet is an extension class which is used only to get a list of members.
Facet provider may add different facets depending on context and object.
\param pO       [in] Object to get facets of.
\param pContext [in] Context.
\param facets  [out] Array of facets.